export const CATEGORIES = [
  'Платья',
  'Блузы',
  'Костюмы юбочные',
  'Костюмы брючные',
  'Жакеты / жилеты',
  'Юбки',
  'Брюки',
  'Костюмы',
  'Сарафаны',
  'Джемперы / туники',
  'Шорты',
  'Домашняя',
  'Комбинезоны',
  'Верхняя одежда'
] as const;

export const SIZES = [
  '40',
  '42',
  '44',
  '46',
  '48',
  '50',
  '52',
  '54',
  '56',
  '58',
  '60',
  '62',
  '64'
] as const;

export const HEIGHTS = [
  '158',
  '164',
  '170'
] as const;

// Категории, для которых нужно указывать рост
export const CATEGORIES_WITH_HEIGHT = [
  'Платья',
  'Костюмы юбочные',
  'Костюмы брючные',
  'Комбинезоны',
  'Брюки'
];

export const SIZE_CHART = [
  { size: '42', bust: '84', waist: '64 - 68', hips: '90 - 92' },
  { size: '44', bust: '88', waist: '68 - 72', hips: '94 - 96' },
  { size: '46', bust: '92', waist: '72 - 76', hips: '98 - 100' },
  { size: '48', bust: '96', waist: '76 - 80', hips: '102 - 104' },
  { size: '50', bust: '100', waist: '80 - 84', hips: '106 - 108' },
  { size: '52', bust: '104', waist: '84 - 88', hips: '110 - 112' },
  { size: '54', bust: '108', waist: '88 - 92', hips: '114 - 116' },
  { size: '56', bust: '112', waist: '92 - 96', hips: '118 - 120' },
  { size: '58', bust: '116', waist: '96 - 100', hips: '122 - 124' },
  { size: '60', bust: '120', waist: '100 - 104', hips: '126 - 128' },
  { size: '62', bust: '124', waist: '104 - 108', hips: '130 - 132' },
  { size: '64', bust: '128', waist: '108 - 112', hips: '134 - 136' }
];